blog/2021/10/11/files-management/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>总结：文件管理方法 - 你对这个世界要有点意见</title>
  <meta charset="utf-8" />
  <meta name="author" content="lijigang" />
  <meta name="description" content="借助原则和工具, 高效文件管理" />


  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">你对这个世界要有点意见</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/">Blog</a></li>
          <li><a href="https://github.com/lijigang">GitHub</a></li>
          <li><a href="http://www.zhihu.com/people/lijigang.com">知乎</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row post-content">
        <div class="col-md-2"></div>
            <h1>总结：文件管理方法</h1>
            <p>
在 macOS 为例, 总结一下自己的文件整理相关心得。
</p>

<div id="outline-container-orgc1235d3" class="outline-2">
<h2 id="orgc1235d3">原则</h2>
<div class="outline-text-2" id="text-orgc1235d3">
<ol class="org-ol">
<li>搜索: 尽可能使用搜索和智能文件夹功能, 减少拖动分类文件夹</li>
<li>自动: 尽可能自动化, 减少手动命名和挪动文件位置</li>
<li>同步: 尽可能云同步, 减少单机本地文件</li>
</ol>
</div>
</div>

<div id="outline-container-org364737f" class="outline-2">
<h2 id="org364737f">桌面(Desktop)</h2>
<div class="outline-text-2" id="text-org364737f">
<p>
根据原则一, 平时不需要根据目录去找文件, 也就不需要桌面更快到达的优势, 所
以 <b>桌面不放任何文件</b> 就是一个更好的选择。
</p>
</div>
</div>

<div id="outline-container-org8b04386" class="outline-2">
<h2 id="org8b04386">下载(Downloads)</h2>
<div class="outline-text-2" id="text-org8b04386">
<p>
总会有些从网络下载东西到本地, 或者从聊天软件中下载文件的需求, 这些文件都
存放在哪呢?
</p>

<p>
所以这类文件, 都统一保存在 <span class="underline">下载</span> 文件夹即可。 可以通过浏览器和聊天软件的
设置项, 修改默认下载目录, 指定为 <code>~/Downloads/</code> 目录。
</p>

<p>
这样一来, 下载目录就变成了你的守门人, 所有新进来的临时文件全部都拦在了该
目录中。
</p>

<p>
接下来, 需要做两个动作 <b>归档</b> 和 <b>自动删除</b> 。
</p>
</div>

<div id="outline-container-org63dba34" class="outline-3">
<h3 id="org63dba34">归档: QSpace</h3>
<div class="outline-text-3" id="text-org63dba34">
<p>
可以从 App Store 下载一个应用 <code>QSpace</code> , 该应用可看作是 Finder 的升级, 默认
即可同时展示四个目录的窗口, 极大的提升了归档文件的效率。
</p>

<p>
对于每个进入到下载目录的文件, 养成随手归档的好习惯。
</p>

<p>
对于一些明确知晓要归档到哪些目录的情况, 也可以通过软件 <code>Hazel</code> 来实现自动
化归档的功能。比如可以设定监控下载目录, 当其中有大小超过 500MB 的文件时,
自动移动该文件到 <code>Big Files</code> 目录。
</p>
</div>
</div>

<div id="outline-container-orga062c9f" class="outline-3">
<h3 id="orga062c9f">自动删除: Hazel</h3>
<div class="outline-text-3" id="text-orga062c9f">
<p>
留在下载目录中的文件, 默认可以认为是不再需要的文件, 根据原则二, 可以借助
<code>Hazel</code> 的能力, 来实现每天定时自动清空下载目录的功能。
</p>

<p>
比如可以设置为, 每天清空今日之前的所有文件到 Trash 中。这样一来, 每天你打
开下载目录时, 面对的都是一个空空如也的全新目录, 实现了 <code>Inbox Zero</code> 的效果。
</p>

<p>
Hazel 甚至可以支持, 自动检测指定目录中新增的压缩包文件, 自动解压缩该文件
到同名文件夹, 自动删除该压缩包。
</p>
</div>
</div>
</div>

<div id="outline-container-orgef34182" class="outline-2">
<h2 id="orgef34182">文件命名: 三段式</h2>
<div class="outline-text-2" id="text-orgef34182">
<p>
在地球上, 你只需要知道了经度, 纬度, 和海拔高度这三维数据, 就能定位到任意
一个位置。
</p>

<p>
在文件命名时, 我们也可以借鉴地理定位的三段式方法来命名, 例如:
</p>

<ul class="org-ul">
<li>针对照片, 可以按照[时间]-[地点]-[对象]的方式命名</li>
<li>针对文件, 可以按照[时间]-[项目]-[描述]的方式命名</li>
</ul>
</div>
</div>

    </div>
</section>




<footer id="footer">
    <br />
    <script>
        var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "https://hm.baidu.com/hm.js?36d44a2295ffa55a3ab51c6aa7a71733";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();
    </script>
</footer>

  </body>
</html>
